'''След оптимизации във фабриката за подаръци, производителността на джуджетата се е покачила.
Не се знае обаче, колко общо подаръка ще могат да бъдат произведени преди настъпването на Голямото Коледно Пътуване на Добрия Старец.
Едно от джуджетата (Математичко) е доказало, че за постигане на максимален брой произведени подаръци,
джуджтата трябва да бъдат разделени на два отдела - един, в който работят A на брой джуджетата и един, в който работят B.
Тогава общият брой произведени подаръци ще бъде точно равен на A^B , където A+B=N и N е броят на джуджетата във фабриката.

Като истински математик, за него доказателството е достатъчно. Реалната стойност а израза няма значение. Тази работа е за вас.
И по-точно, вашата работа е да определите стойностите на A и B.

Input Format

На единствен ред на стандартния вход ще бъде зададено цялото число.

Constraints

2 <= N <= 100

Output Format

На единствения ред на стандартия изход изведете две числа - A и B, които да отговарят на споменатите условия:
Сумата им е точно и е максимална. Ако има няколко възможни наредени двойки, отговарящи на дадените условия, изведете тази с най-малко.

Sample Input 0
10

Sample Output 0
4 6

Explanation 0
4^6 = 4096

Някои от останалите възможности бяха:
5^5 = 3125; 6^4 = 1296; 8^2 = 64
'''

A = 0
B = 0

n = int(input())
answ = {}
for el in range(n - 1, 0, -1):
    A = el
    B = n - el
    res = (A ** B)
    answ[f'{A} {B}'] = res

max_key = max(answ, key=answ.get)
print(max_key)
